configuration/src/InformationRegisters/ОчередиЗаявок/ОчередиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередиЗаявок</name>
  <resources>
    <name>Зафиксирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОчередиОбъекта</name>
    <type>
      <types>CatalogRef.КлючОчереди</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидыОчереди/ВидыОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОчереди</name>
  <enumValues>
    <name>ГабаритноеПланирование</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеСистема</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеСистемаГруппаЗаказчиков</name>
  </enumValues>
  <enumValues>
    <name>ОчередьВТестировании</name>
  </enumValues>
  <enumValues>
    <name>ОчередьГруппыТестирования</name>
  </enumValues>
  <enumValues>
    <name>Продукт</name>
  </enumValues>
  <enumValues>
    <name>ПродуктСистема</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>Канбан</name>
  </enumValues>
</mdclass:Enum>

configuration/src/CommonModules/УправлениеИнструментамиРазработкиВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Изменяет порядок заявки в очереди
//
// Параметры:
//  ПараметрыПеремещения - Структура - дополнительные параметры перетаскивания
//  НовыйПорядок		 - Число - новый порядок в очереди 
//  Зафиксирован		 - Булево - Истина, если зафиксирован, иначе ложь
// 
// Возвращаемое значение:
//  Структура - результат выполнения
//
Функция ОчередьЗаявокИзменитьПорядок(Знач ПараметрыПеремещения, Знач НовыйПорядок, Знач Зафиксирован = Неопределено) Экспорт
	 
	Результат = Новый Структура("Успешно, ТекстОшибки", Истина, ""); 
	
	ВидОчереди = ПараметрыПеремещения.ВидОчереди;
	
	Если ВидОчереди = Перечисления.ВидыОчереди.НаправлениеСистемаГруппаЗаказчиков Тогда
		ЗначенияОчереди = Новый Структура;
		ЗначенияОчереди.Вставить("Направление", ПараметрыПеремещения.Направление);
		ЗначенияОчереди.Вставить("Система", ПараметрыПеремещения.Система);
		ЗначенияОчереди.Вставить("ГруппаЗаказчиков", ПараметрыПеремещения.ГруппаЗаказчиков);
		
	ИначеЕсли ВидОчереди = Перечисления.ВидыОчереди.Продукт Тогда	
		ЗначенияОчереди = Новый Структура("Продукт", ПараметрыПеремещения.Продукт);		
		
	ИначеЕсли ВидОчереди = Перечисления.ВидыОчереди.ПродуктСистема Тогда 
		ЗначенияОчереди = Новый Структура("Продукт, Система", ПараметрыПеремещения.Продукт, ПараметрыПеремещения.Система);		
		
	ИначеЕсли ВидОчереди = Перечисления.ВидыОчереди.Филиал Тогда
		ЗначенияОчереди = Новый Структура("Филиал", ПараметрыПеремещения.Филиал);	
		
	Иначе
		ЗначенияОчереди = Неопределено;	
	КонецЕсли; 
		
	Если ЗначенияОчереди <> Неопределено Тогда
		Результат = РегистрыСведений.ОчередиЗаявок.ИзменитьПорядок(ПараметрыПеремещения.Заявка, ВидОчереди, 
			ЗначенияОчереди, ПараметрыПеремещения.Порядок, НовыйПорядок, Зафиксирован);
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

#КонецОбласти
